channelWithObstacle/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon|R|nuTilda)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
}

// SIMPLE
// {
//     nNonOrthogonalCorrectors 0;

//     residualControl
//     {
//         p               1e-2;
//         U               1e-3;
//         "(k|epsilon|omega)" 1e-3;
//     }
// }

// relaxationFactors
// {
//     fields
//     {
//         p               0.3;
//     }
//     equations
//     {
//         U               0.7;
//         k               0.7;
//         epsilon         0.7;
//         R               0.7;
//         nuTilda         0.7;
//     }
// }

// ************************************************************************* //
